package src.class01;


/*
 * 位运算：
 *
 * 每一个int的底层都是32位的二进制
 * 每一个long类型的底层都是64位的二进制
 *
 * 1：	00000000000000000000000000000001
 * 2: 	00000000000000000000000000000010
 * 3: 	00000000000000000000000000000011
 * ...
 * 23:	00000000000000000000000000010111
 *
 * 1<<31	表示1左移31位，最后变为：1000 0000， 0000 0000， 0000 0000， 0000 0000
 * num && (1<<31)	表示 num & 10000000000000000000000000000000，如果num是正数，那么结果是0，否则结果是1
 *
 * 1 << 8 表示1左移8位，最后变为:	0000 0000， 0000 0000， 1000 0000， 0000 0000
 *
 *
 * num<<1 等同于 num * 2
 */

public class Code01_PrintBinary {
	// 打印num的二进制
	public static void print(int num) {
		for (int i = 31; i >= 0; i--) {
			System.out.print((num & (1 << i)) == 0 ? "0" : "1");
		}
		System.out.println();
	}

	public static void main(String[] args) {
		// 测试函数
		int num = 23;
		print(num);

		// 测试位运算
		int test = 3;
		print(test);         //	00000000000000000000000000000011
		print(test << 1);    //	00000000000000000000000000000110
		print(test << 2);    //	00000000000000000000000000001100
		print(test << 8);    //	00000000000000000000001100000000


		// 整型是有符号数，最大值为：2147483647 = 2^31 - 1，最高位表示符号
		int max = Integer.MAX_VALUE;
		System.out.println(max);


		// 负数
		print(-1);    //	11111111111111111111111111111111


		// 系统最小的数：10000000000000000000000000000000
		int min = Integer.MIN_VALUE;
		print(min);


		// 正数取反
		int b = 5;
		int c = ~b;
		print(b);    // 00000000000000000000000000000101
		print(c);    // 11111111111111111111111111111010


		// 负数取反
		int d = -5;    // 负数的执行逻辑为将正数的值：先取反，后加1
		int e = ~d;
		print(d);    // 11111111111111111111111111111011
		print(e);    // 00000000000000000000000000000100


		// 测试系统最小值和最大值
		System.out.println(Integer.MAX_VALUE);    // 2147483647 = 2^31 - 1
		System.out.println(Integer.MIN_VALUE);    // -2147483648 = 2^31

		System.out.println("------------------");

		// 测试位运算
		int m = 5;
		int n = 3;
		print(m);        // 00000000000000000000000000000101
		print(n);        // 00000000000000000000000000000011
		System.out.println("=============");
		print(m | n);    // 00000000000000000000000000000111
		print(m & n);    // 00000000000000000000000000000001
		print(m ^ n);    // 00000000000000000000000000000110

		System.out.println("=======右移======");

		// 正数右移，>>:左侧的新位置用符号位填充；	>>>:左侧的新位置不带符号位，用0填充；
		int p = 1024;
		print(p);            // 00000000000000000000010000000000
		print(p >> 2);       // 00000000000000000000000100000000
		print(p >>> 2);      // 00000000000000000000000100000000

		// 负数右移
		int q = Integer.MIN_VALUE;
		print(q);           // 10000000000000000000000000000000
		print(q >> 2);      // 11100000000000000000000000000000
		print(q >>> 2);     // 00100000000000000000000000000000

		System.out.println("=======相反数======");

		// 测试相反数
		int x = 5;
		// int x = Integer.MIN_VALUE;

		int y = -x;
		// 相反数也可以写成：
		int z = (~x + 1);

		print(x);    // 00000000000000000000000000000101
		print(y);    // 11111111111111111111111111111011
		print(z);    // 11111111111111111111111111111011
		System.out.println(x);    // 5
		System.out.println(y);    // -5
		System.out.println(z);    // -5
	}
}